# Prática 04 – Análise de Dados de Funcionários

## Objetivo
Praticar dicionários avançados, sets para operações de conjunto, funções com **kwargs e manipulação de arquivos.

## Dataset
`datasets/funcionarios_empresa.csv`

**Colunas:** ID, Nome, Departamento, Cargo, Salario, Data_Admissao, Cidade, Ativo

## Referências do Curso
- **Notebook:** `Programacao_Intensiva_Ciencia_de_Dados.ipynb`
  - Seção 1.2 – Estruturas de Dados Fundamentais (dicionários, sets e operações de conjunto)
  - Seção 1.5 – Funções Avançadas (função `calcular_estatisticas` como modelo)
  - Seção 1.6 – Manipulação de Arquivos (leitura e escrita)
- **Documentação:** `documentacao_completa.md`
  - Seção 2.2 – Dicionários e Sets (operações de conjunto: união, interseção, diferença)
  - Seção 2.3 – Funções (**kwargs, documentação)

## Tarefas

### Nível Básico
1. Ler o CSV e criar um dicionário onde a chave é o ID e o valor é um dicionário com os dados do funcionário
2. Calcular o salário médio de todos os funcionários
3. Listar todos os departamentos únicos usando set
4. Contar quantos funcionários estão ativos e inativos

In [1]:
import pandas as pd

db = pd.read_csv("datasets/funcionarios_empresa.csv")

db.head()

,ID,Nome,Departamento,Cargo,Salario,Data_Admissao,Cidade,Ativo
0,1,Lucas Ramos,Marketing,Analista de Marketing,4533.46,2024-06-08,Belo Horizonte,False
1,2,Amanda Pinto,Operacoes,Gerente de Operacoes,8369.77,2018-01-24,Joao Pessoa,False
2,3,Tatiana Andrade,Vendas,Gerente de Vendas,6678.41,2021-09-21,Sao Luis,True
3,4,Raquel Nunes,Financeiro,Gerente Financeiro,12577.42,2018-03-04,Belem,False
4,5,Helena Melo,Marketing,Social Media,5987.94,2023-07-22,Campinas,False

In [4]:
db["Salario"].mean()

np.float64(7377.976)

In [5]:
db["Departamento"].unique()

<StringArray>
['Marketing', 'Operacoes', 'Vendas', 'Financeiro', 'TI', 'RH']
Length: 6, dtype: str

In [6]:
db["Ativo"].value_counts()

Ativo
False    24
True     16
Name: count, dtype: int64

### Nível Intermediário
5. Criar sets de funcionários por departamento e usar operações de conjunto para encontrar: cidades que têm funcionários em TODOS os departamentos (interseção)
6. Criar uma função `filtrar_funcionarios(**criterios)` que aceite critérios variáveis como departamento, salario_min, ativo, etc.
7. Calcular o salário médio por departamento usando dicionário
8. Identificar os 5 funcionários com maior e menor salário

In [ ]:
import pandas as pd
'''
# Novos funcionários
novos_funcionarios = pd.DataFrame([
    {
        "ID": 6,
        "Nome": "Carlos Eduardo",
        "Departamento": "Financeiro",
        "Cargo": "Analista Financeiro",
        "Salario": 7200.00,
        "Data_Admissao": "2022-05-10",
        "Cidade": "Campinas",
        "Ativo": True
    },
    {
        "ID": 7,
        "Nome": "Fernanda Silva",
        "Departamento": "RH",
        "Cargo": "Analista de RH",
        "Salario": 5100.00,
        "Data_Admissao": "2023-03-15",
        "Cidade": "Campinas",
        "Ativo": True
    },
    {
        "ID": 8,
        "Nome": "Bruno Martins",
        "Departamento": "Financeiro",
        "Cargo": "Assistente Financeiro",
        "Salario": 4200.00,
        "Data_Admissao": "2024-01-12",
        "Cidade": "Campinas",
        "Ativo": False
    }
])
'''
# Adicionar ao dataset
#db = pd.concat([db, novos_funcionarios], ignore_index=True)

# Verificar
#print(db.tail())

    ID            Nome Departamento                  Cargo   Salario  \
38  39     Murilo Dias           TI          Desenvolvedor  13012.70
39  40   Eduardo Nunes   Financeiro             Tesoureiro   6882.86
40   6  Carlos Eduardo   Financeiro    Analista Financeiro   7200.00
41   7  Fernanda Silva           RH         Analista de RH   5100.00
42   8   Bruno Martins   Financeiro  Assistente Financeiro   4200.00

   Data_Admissao          Cidade  Ativo
38    2022-04-20        Campinas   True
39    2023-03-08  Belo Horizonte  False
40    2022-05-10        Campinas   True
41    2023-03-15        Campinas   True
42    2024-01-12        Campinas  False

In [23]:
total_de_departamentos = len(db["Departamento"].unique())

dp_cidade_max = 0

for cidade in db["Cidade"].unique():
    depatamentos_por_cidade = db[db["Cidade"] == cidade]["Departamento"].unique()
    if len(depatamentos_por_cidade) > dp_cidade_max:
        dp_cidade_max = len(depatamentos_por_cidade)
        #print(f"Cidade: {cidade}")

    if len(depatamentos_por_cidade) == total_de_departamentos:
        print(f"Cidade: {cidade}")
        print(db[db["Cidade"] == cidade]["Departamento"].unique())

Cidade: Campinas
<StringArray>
['Marketing', 'Operacoes', 'Vendas', 'TI', 'Financeiro', 'RH']
Length: 6, dtype: str

In [30]:
def filtrar_funcionarios(dados, **criterios):
    resultado = dados.copy()

    filtros = []

    if "salario_min" in criterios:
        filtros.append(resultado["Salario"] >= criterios["salario_min"])

    if "salario_max" in criterios:
        filtros.append(resultado["Salario"] <= criterios["salario_max"])

    if "Departamento" in criterios:
        filtros.append(resultado["Departamento"] == criterios["Departamento"])

    if "Ativo" in criterios:
        filtros.append(resultado["Ativo"] == criterios["Ativo"])

    if filtros:
        resultado = resultado.loc[
            filtros[0] &
            (filtros[1] if len(filtros) > 1 else True)
        ]
        for f in filtros[2:]:
            resultado = resultado.loc[f]

    return resultado

In [32]:
filtrar_funcionarios(db,Departamento="Financeiro", Ativo=False)

,ID,Nome,Departamento,Cargo,Salario,Data_Admissao,Cidade,Ativo
3,4,Raquel Nunes,Financeiro,Gerente Financeiro,12577.42,2018-03-04,Belem,False
11,12,Rafael Barros,Financeiro,Gerente Financeiro,7314.27,2017-09-27,Sao Luis,False
18,19,Thiago Cunha,Financeiro,Contador,9981.35,2022-01-14,Sao Paulo,False
19,20,Juliana Reis,Financeiro,Contador,2716.80,2018-04-23,Goiania,False
20,21,Bruno Melo,Financeiro,Gerente Financeiro,12711.38,2017-11-18,Teresina,False
22,23,Caio Silva,Financeiro,Analista Financeiro,7639.61,2022-07-18,Manaus,False
39,40,Eduardo Nunes,Financeiro,Tesoureiro,6882.86,2023-03-08,Belo Horizonte,False
42,8,Bruno Martins,Financeiro,Assistente Financeiro,4200.00,2024-01-12,Campinas,False

In [46]:
salario_por_departamento = db.groupby("Departamento")["Salario"].mean().reset_index()
salario_por_departamento

  Departamento      Salario
0   Financeiro  7913.743333
1    Marketing  5610.538750
2    Operacoes  7277.330000
3           RH  7520.246667
4           TI  7094.963333
5       Vendas  8047.338571

In [49]:
maior_salario = db["Salario"].max()
funcionario_maior_salario = db[db["Salario"] == maior_salario]
menor_salario = db["Salario"].min()
funcionario_menor_salario = db[db["Salario"] == menor_salario]
print(f"Funcionario com o maior salário: {funcionario_maior_salario}")

print(f"Funcionario com o menor salário: {funcionario_menor_salario}")

Funcionario com o maior salário:     ID            Nome Departamento                Cargo   Salario  \
16  17  Samuel Cardoso       Vendas  Consultor Comercial  14901.34

   Data_Admissao     Cidade  Ativo
16    2018-04-24  Fortaleza  False
Funcionario com o menor salário:    ID          Nome Departamento          Cargo  Salario Data_Admissao  \
7   8  Helena Costa       Vendas  Representante  1707.19    2016-08-13

        Cidade  Ativo
7  Joao Pessoa   True

### Nível Avançado
9. Calcular o tempo de empresa de cada funcionário (diferença de datas usando apenas Python puro)
10. Criar uma função que gere um arquivo CSV `relatorio_departamentos.csv` com: departamento, qtd_funcionarios, salario_medio, salario_max, salario_min
11. Implementar uma busca por nome parcial (case insensitive) usando compreensão de listas
12. Criar um sistema de menu simples (usando while + input simulado) que permita consultar dados por departamento, por faixa salarial ou gerar relatório

In [54]:
db.head()

,ID,Nome,Departamento,Cargo,Salario,Data_Admissao,Cidade,Ativo,Tempo_Empresa_Dias
0,1,Lucas Ramos,Marketing,Analista de Marketing,4533.46,2024-06-08,Belo Horizonte,False,627
1,2,Amanda Pinto,Operacoes,Gerente de Operacoes,8369.77,2018-01-24,Joao Pessoa,False,2954
2,3,Tatiana Andrade,Vendas,Gerente de Vendas,6678.41,2021-09-21,Sao Luis,True,1618
3,4,Raquel Nunes,Financeiro,Gerente Financeiro,12577.42,2018-03-04,Belem,False,2915
4,5,Helena Melo,Marketing,Social Media,5987.94,2023-07-22,Campinas,False,949

In [55]:
db["Data_Admissao"] = pd.to_datetime(db["Data_Admissao"])
hoje = pd.Timestamp.today()

db["Tempo_Empresa_Dias"] = (hoje - db["Data_Admissao"]).dt.days

In [56]:
import pandas as pd

def gerar_relatorio_departamentos(db, nome_arquivo="relatorio_pratica_4.csv"):

    relatorio = (
        db.groupby("Departamento")["Salario"]
          .agg(
              qtd_funcionarios="count",
              salario_medio="mean",
              salario_max="max",
              salario_min="min"
          )
          .reset_index()
    )

    # Arredondar salário médio para 2 casas
    relatorio["salario_medio"] = relatorio["salario_medio"].round(2)

    # Salvar CSV
    relatorio.to_csv(nome_arquivo, index=False)

    print(f"Arquivo '{nome_arquivo}' gerado com sucesso!")

    return relatorio

In [57]:
gerar_relatorio_departamentos(db)

Arquivo 'relatorio_pratica_4.csv' gerado com sucesso!

  Departamento  qtd_funcionarios  salario_medio  salario_max  salario_min
0   Financeiro                 9        7913.74     12711.38      2716.80
1    Marketing                 8        5610.54     13453.09      2321.14
2    Operacoes                10        7277.33     13776.73      2317.43
3           RH                 6        7520.25     10111.71      5100.00
4           TI                 3        7094.96     13012.70      2423.68
5       Vendas                 7        8047.34     14901.34      1707.19